app/views/user_books/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
---
    <%= form.label :user_id %><br>
    <%= form.select :user_id, User.order(:username).map { |u| [u.username, u.id] },
          include_blank: true, id: "id_of_the_user_id_select_box" %>

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
    <%= form.label :book_id %><br>
    <%= form.select :book_id, Book.order(:title).map { |b| [b.title, b.id] },
          include_blank: true, id: "id_of_the_book_id_select_box" %>