app/views/user_books/index.html.erb

  <tbody>
    <% @user_books.includes(:user, :book).each do |ub| %>
---
SELECT "books".* FROM "books" WHERE "books"."id" IN ($1, $2)  [["id", 4], ["id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]